# Taps
tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
# brew 'bash' # Latest Bash version
# brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
# brew 'gh'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
# brew 'gnupg2'
# brew 'grep'
# brew 'httpie'
# brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe'
# brew 'svn'
# brew 'trash' # Manage the Trash bin
# brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'php@7.2'
# brew 'php@7.1'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'microsoft-teams'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
# brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
# cask 'aerial'
# cask 'alfred'
cask 'app-cleaner'
cask 'backblaze'
cask 'bbedit'
# cask 'caffeine'
cask 'cyberduck'
cask 'dbngin'
cask 'db-browser-for-sqlite'
# cask 'discord'
# cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
# cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'macdown'
cask 'nordvpn'
# cask 'notion'
cask 'paw'
cask 'phpstorm'
# cask 'screenflow'
cask 'signal'
cask 'skype'
cask 'slack'
# cask 'steam'
cask 'sublime-text'
# cask 'tableplus'
# cask 'telegram-desktop'
cask 'the-unarchiver'
# cask 'there'
cask 'tinkerwell'
cask 'transmission'
cask 'transmit'
cask 'tweetbot'
# cask 'visual-studio-code'
cask 'vlc'
# cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
# mas 'HiddenMe Pro', id: 1007499919 
# mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'MacTracker', id: 430255202
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Sequel Ace', id: 1518036000
# mas 'Trello', id: 1278508951
# mas 'Wallcat', id: 1000397973
mas 'WhatsApp', id: 1147396723
